var errorcode ={
    1000: "操作成功",  
 
    1001: "未登录",  
 
    1002: "权限不足",  
 
    1003: "参数不匹配",  
 
    1004: "未知错误",  
 
    1005: "请求方法不支持错误",  
 
    1011: "上传文件失败",  
 
    2001: "注册失败",  
 
    2002: "用户不存在",  
 
    2003: "用户禁用",  
 
    2004: "用户已登录",  
 
    2005: "账号或密码错误",  
 
    2006: "登出失败",  
 
    2007: "修改用户信息失败",  
 
    2008: "密码错误",  
 
    2009: "修改密码失败",  
 
    2010: "已经签到",  
 
    2011: "签到失败",  
 
    2012: "退群失败",  
 
    2013: "屏蔽失败",  
 
    3001: "已经是好友",  
 
    3002: "添加好友失败",  
 
    3003: "好友不存在",  
 
    3004: "删除好友失败",  
 
    3011: "好友分组已存在",  
 
    3012: "添加好友分组失败",  
 
    3013: "好友分组不存在",  
 
    3014: "好友分组不允许删除",  
 
    3015: "删除好友分组失败",  
 
    3016: "删除好友分组失败",  
 
    3017: "用户已经在好友分组中",  
 
    3018: "移动好友失败",  
 
    4001: "新建群组失败",  
 
    4002: "修改群组名失败",  
 
    4003: "用户已经在群组中",  
 
    4004: "用户不在群组中",  
 
    4005: "添加群组用户失败",  
 
    4006: "删除群组用户失败",  
 
    4007: "删除群组失败",  
 
    5001: "修改用户信息失败",  
 
    5003: "修改用户权限失败",  
 
    5004: "删除用户失败",  
 
    6001: "发布公告失败",  
 
    6002: "公告不存在",  
 
    6003: "删除公告失败",  
 
    7001: "记事不存在",  
 
    7002: "添加记事失败",  
 
    7003: "修改记事失败"  
}